results/low/modes_case/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
440
(
(0.673676 0.788773 2.22139e-17)
(0.725448 0.84939 -4.20008e-17)
(0.777223 0.910011 5.92522e-17)
(0.829 0.970635 0)
(0.88078 1.03126 0)
(0.54199 0.884448 4.597e-17)
(0.583642 0.952417 2.21447e-17)
(0.625297 1.02039 0)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<vector> 
17
(
(-5 1.14095 0)
(-5 1.44296 0)
(-5 1.74497 0)
(-5 2.04698 0)
(-5 2.34899 0)
(-5 0.0989949 0)
(-5 0.296985 0)
(-5 0.494974 0)
(-5 0.692964 0)
(-5 0.890954 0)
(-5 -0.890954 0)
(-5 -0.692964 0)
(-5 -0.494974 0)
(-5 -0.296985 0)
(-5 -0.0989949 0)
(-5 -1.37249 0)
(-5 -1.11746 0)
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<vector> 
17
(
(5 -1.37249 0)
(5 -1.11746 0)
(5 -0.890954 0)
(5 -0.692964 0)
(5 -0.494974 0)
(5 -0.296985 0)
(5 -0.0989949 0)
(5 0.0989949 0)
(5 0.296985 0)
(5 0.494974 0)
(5 0.692964 0)
(5 0.890954 0)
(5 1.14095 0)
(5 1.44296 0)
(5 1.74497 0)
(5 2.04698 0)
(5 2.34899 0)
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<vector> 
20
(
(-4.59899 -1.5 0)
(-3.79698 -1.5 0)
(-2.99497 -1.5 0)
(-2.19296 -1.5 0)
(-1.39095 -1.5 0)
(-0.890954 -1.5 0)
(-0.692964 -1.5 0)
(-0.494974 -1.5 0)
(-0.296985 -1.5 0)
(-0.0989949 -1.5 0)
(0.0989949 -1.5 0)
(0.296985 -1.5 0)
(0.494974 -1.5 0)
(0.692964 -1.5 0)
(0.890954 -1.5 0)
(1.39095 -1.5 0)
(2.19296 -1.5 0)
(2.99497 -1.5 0)
(3.79698 -1.5 0)
(4.59899 -1.5 0)
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<vector> 
20
(
(1.39095 2.5 0)
(2.19296 2.5 0)
(2.99497 2.5 0)
(3.79698 2.5 0)
(4.59899 2.5 0)
(0.0989949 2.5 0)
(0.296985 2.5 0)
(0.494974 2.5 0)
(0.692964 2.5 0)
(0.890954 2.5 0)
(-0.890954 2.5 0)
(-0.692964 2.5 0)
(-0.494974 2.5 0)
(-0.296985 2.5 0)
(-0.0989949 2.5 0)
(-4.59899 2.5 0)
(-3.79698 2.5 0)
(-2.99497 2.5 0)
(-2.19296 2.5 0)
(-1.39095 2.5 0)
)
;
    }
    cylinder
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(0.993844 0.0782173 0)
(0.969373 0.232726 0)
(0.921032 0.381504 0)
(0.850012 0.520888 0)
(0.758062 0.647446 0)
(0.647446 0.758062 0)
(0.520888 0.850011 0)
(0.381504 0.921031 0)
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
